[
 {
   "id": 1,
   "movie_name": "Tenet",
   "img_url": "https://static.metacritic.com/images/products/movies/7/a60818c40f69031bf30ca846444011e4-250h.jpg",
   "release_year": 2020,
   "summary": "Armed with only one word - Tenet - and fighting for the survival of the entire world the Protagonist (John David Washington) journeys through a twilight world of international espionage on a mission that will unfold in something beyond real time. Not time travel. Inversion.",
   "director": "Christopher Nolan",
   "genre": "Action",
   "rating": "PG-13",
   "movie_runtime": 150,
   "meta_score": 69
 },
 {
   "id": 2,
   "movie_name": "Mulan",
   "img_url": "https://static.metacritic.com/images/products/movies/0/a496c3f832582876dc9b0d66197cab78-250h.jpg",
   "release_year": 2020,
   "summary": "When the Emperor of China issues a decree that one man per family must serve in the Imperial Army to defend the country from Northern invaders Hua Mulan the eldest daughter of an honored warrior steps in to take the place of her ailing father. Masquerading as a man Hua Jun she is tested every step of the way and must harness her inner-strength and embrace her true potential. It is an epic journey that will transform her into an honored warrior and earn her the respect of a grateful nation…and a proud father.",
   "director": "Niki Caro",
   "genre": "Action",
   "rating": "PG-13",
   "movie_runtime": 115,
   "meta_score": 67
 },
 {
   "id": 3,
   "movie_name": "The Old Guard",
   "img_url": "https://static.metacritic.com/images/products/movies/7/b1db3c24db156b33c9fcfbbc199fcfcb-250h.jpg",
   "release_year": 2020,
   "summary": "Led by a warrior named Andy (Charlize Theron) a covert group of tight-knit mercenaries with a mysterious inability to die have fought to protect the mortal world for centuries. But when the team is recruited to take on an emergency mission and their extraordinary abilities are suddenly exposed it’s up to Andy and Nile (Kiki Layne) the newest soldier to join their ranks to help the group eliminate the threat of those who seek to replicate and monetize their power by any means necessary.",
   "director": "Gina Prince-Bythewood",
   "genre": "Action",
   "rating": "R",
   "movie_runtime": 125,
   "meta_score": 70
 },
 {
   "id": 4,
   "movie_name": "Greyhound",
   "img_url": "https://static.metacritic.com/images/products/movies/4/499215874bac5acda666be3659bacf7e-250h.jpg",
   "release_year": 2020,
   "summary": "In the early days of WWII an international convoy of 37 Allied ships led by captain Ernest Krause (Tom Hanks) in his first command of a U.S. destroyer crosses the treacherous North Atlantic while hotly pursued by wolf packs of Nazi U-boats.",
   "director": "Aaron Schneider",
   "genre": "Action",
   "rating": "PG-13",
   "movie_runtime": 91,
   "meta_score": 64
 },
 {
   "id": 5,
   "movie_name": "The New Mutants",
   "img_url": "https://static.metacritic.com/images/products/movies/4/8fcef9e9a93457f7a0fdf2a51cf30a0d-250h.jpg",
   "release_year": 2020,
   "summary": "In an isolated hospital young mutants are being held for psychiatric monitoring. When strange occurrences begin to take place both their new mutant abilities and their friendships will be tested as they battle to try and make it out alive.",
   "director": "Josh Boone",
   "genre": "Action",
   "rating": "PG-13",
   "movie_runtime": 94,
   "meta_score": 43
 },
 {
   "id": 6,
   "movie_name": "I Used to Go Here",
   "img_url": "https://static.metacritic.com/images/products/movies/5/9456ab11b0bd3b457f32c6c58157bf95-250h.jpg",
   "release_year": 2020,
   "summary": "Following the lackluster launch of her debut novel 35-year-old writer Kate Conklin (Gillian Jacobs) receives an invitation from her former professor and old crush (Jemaine Clement) to speak at her alma mater. With her book tour canceled and her ego deflated Kate decides to take the trip wondering if returning to her old college as a published author might give her the morale boost she sorely needs. Instead she falls into a comical regression – from misadventures with eccentric twenty-year-olds to feelings of jealousy toward her former professor’s new favorite student. Striking the balance between bittersweet and hilarious Kate takes a journey through her past to redefine her future.",
   "director": "Kris Rey",
   "genre": "Comedy",
   "rating": "PG-13",
   "movie_runtime": 80,
   "meta_score": 68
 },
 {
   "id": 7,
   "movie_name": "Hooking Up",
   "img_url": "https://static.metacritic.com/images/products/movies/0/fffb93ea39fcce7d65563163daa57c4c-250h.jpg",
   "release_year": 2020,
   "summary": "She (Brittany Snow) is an adventurous writer pumping out scandalous content for a lifestyle magazine. He (Sam Richardson) is a hopeless romantic who’s just been dumped by his high school sweetheart and given a medical diagnosis that’s left him shook. After a chance meeting the mismatched duo hit the road on a cross country trip to provide them both some much needed healing.",
   "director": "Nico Raineau",
   "genre": "Drama",
   "rating": "R",
   "movie_runtime": 104,
   "meta_score": 44
 },
 {
   "id": 8,
   "movie_name": "Infamous",
   "img_url": "https://static.metacritic.com/images/products/movies/4/6da52f15b0fec577a53de1255cff6518-250h.jpg",
   "release_year": 2020,
   "summary": "Living in a small Florida town and working at a diner was never Arielle's (Bella Thorne) dream life. She's always wanted more. Fame. Popularity. Admiration. When she falls for a recently paroled young criminal named Dean she drags him back into a life of danger learning that posting their criminal exploits on social media is an easy way to viral fame. Obsessed with their rising number of followers they embark on a dangerous adventure together that leads to robbery cop chases and even murder. Heading to Hollywood the City of Stars they will realize what it takes to become famous and have to decide if this dangerous lifestyle is really worth it.",
   "director": "Joshua Caldwell",
   "genre": "Drama",
   "rating": "PG-13",
   "movie_runtime": 100,
   "meta_score": 40
 },
 {
   "id": 9,
   "movie_name": "The Night Clerk",
   "img_url": "https://static.metacritic.com/images/products/movies/4/c4c0324ddd06ad36fe0aa2c47d8f0deb-250h.jpg",
   "release_year": 2020,
   "summary": "While on duty a young socially challenged hotel clerk (Tye Sheridan) witnesses a murder in one of the rooms but his suspicious actions land him as the lead detective’s (John Leguizamo) number one suspect.",
   "director": "Michael Cristofer",
   "genre": "Drama",
   "rating": "R",
   "movie_runtime": 90,
   "meta_score": 44
 },
 {
   "id": 10,
   "movie_name": "Terminal",
   "img_url": "https://static.metacritic.com/images/products/movies/8/03b2d576fd4df069a56132209b2edbb9-250h.jpg",
   "release_year": 2018,
   "summary": "In the dark heart of a sprawling anonymous city Terminal follows the twisting tales of two assassins carrying out a sinister mission a teacher battling a fatal illness an enigmatic janitor and a curious waitress leading a dangerous double life. Murderous consequences unravel in the dead of night as their lives all intertwine at the hands of a mysterious criminal mastermind hell-bent on revenge.",
   "director": "Vaughn Stein",
   "genre": "Drama",
   "rating": "R",
   "movie_runtime": 95,
   "meta_score": 27
 }
]